In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'dogs': [23, 17, 5, 12, 1, 5],
    'birds': [10, 7, 13, 2, 8, 19],
    'cats': [4, 14, 8, 15, 11, 3]}
data

{'dogs': [23, 17, 5, 12, 1, 5],
 'birds': [10, 7, 13, 2, 8, 19],
 'cats': [4, 14, 8, 15, 11, 3]}

In [4]:
type(data)

dict

In [5]:
df = pd.DataFrame(data)
df

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8
3    12      2    15
4     1      8    11
5     5     19     3

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dogs    6 non-null      int64
 1   birds   6 non-null      int64
 2   cats    6 non-null      int64
dtypes: int64(3)
memory usage: 272.0 bytes

In [7]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
df.values

array([[23, 10,  4],
       [17,  7, 14],
       [ 5, 13,  8],
       [12,  2, 15],
       [ 1,  8, 11],
       [ 5, 19,  3]], dtype=int64)

In [9]:
df.dtypes

dogs     int64
birds    int64
cats     int64
dtype: object

In [11]:
df.head(n=3)

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8

In [12]:
idx_names = ['shelter0', 'shelter1', 'shelter2', 'shelter3', 'shelter4', 'shelter5']
df = pd.DataFrame(data, index=idx_names)
df

          dogs  birds  cats
shelter0    23     10     4
shelter1    17      7    14
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

In [13]:
df.loc['shelter3']

dogs     12
birds     2
cats     15
Name: shelter3, dtype: int64

In [14]:
df.loc['shelter3','dogs']

12

In [15]:
df[2:5]

          dogs  birds  cats
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11

In [16]:
df.iloc[:,1]

shelter0    10
shelter1     7
shelter2    13
shelter3     2
shelter4     8
shelter5    19
Name: birds, dtype: int64

In [18]:
df.loc[:,['birds']]

          birds
shelter0     10
shelter1      7
shelter2     13
shelter3      2
shelter4      8
shelter5     19

In [20]:
df.iloc[0:5,0:2]

          dogs  birds
shelter0    23     10
shelter1    17      7
shelter2     5     13
shelter3    12      2
shelter4     1      8

In [21]:
df['dogs']

shelter0    23
shelter1    17
shelter2     5
shelter3    12
shelter4     1
shelter5     5
Name: dogs, dtype: int64

In [22]:
df[['dogs','birds']]

          dogs  birds
shelter0    23     10
shelter1    17      7
shelter2     5     13
shelter3    12      2
shelter4     1      8
shelter5     5     19

In [23]:
df.sort_values(by='cats')

          dogs  birds  cats
shelter5     5     19     3
shelter0    23     10     4
shelter2     5     13     8
shelter4     1      8    11
shelter1    17      7    14
shelter3    12      2    15

In [24]:
df.sort_values(by='birds', ascending=False)

          dogs  birds  cats
shelter5     5     19     3
shelter2     5     13     8
shelter0    23     10     4
shelter4     1      8    11
shelter1    17      7    14
shelter3    12      2    15

In [25]:
df.sort_values(by='birds', ascending=True)

          dogs  birds  cats
shelter3    12      2    15
shelter1    17      7    14
shelter4     1      8    11
shelter0    23     10     4
shelter2     5     13     8
shelter5     5     19     3

In [26]:
df.describe()

           dogs      birds       cats
count   6.00000   6.000000   6.000000
mean   10.50000   9.833333   9.166667
std     8.38451   5.776389   5.036533
min     1.00000   2.000000   3.000000
25%     5.00000   7.250000   5.000000
50%     8.50000   9.000000   9.500000
75%    15.75000  12.250000  13.250000
max    23.00000  19.000000  15.000000

In [27]:
df.T

       shelter0  shelter1  shelter2  shelter3  shelter4  shelter5
dogs         23        17         5        12         1         5
birds        10         7        13         2         8        19
cats          4        14         8        15        11         3

In [29]:
# Advanced pandas function
df

          dogs  birds  cats
shelter0    23     10     4
shelter1    17      7    14
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

In [33]:
# Use of apply and lambda 
df['dogs'] = df['dogs'].apply(lambda x: x*17)
df['birds'] = df['birds'].apply(lambda x: x*2)

In [34]:
df

          dogs  birds  cats
shelter0  6647     20     4
shelter1  4913     14    14
shelter2  1445     26     8
shelter3  3468      4    15
shelter4   289     16    11
shelter5  1445     38     3

In [37]:
df.applymap(lambda x:x//2)

          dogs  birds  cats
shelter0  3323     10     2
shelter1  2456      7     7
shelter2   722     13     4
shelter3  1734      2     7
shelter4   144      8     5
shelter5   722     19     1

In [38]:
df<50

           dogs  birds  cats
shelter0  False   True  True
shelter1  False   True  True
shelter2  False   True  True
shelter3  False   True  True
shelter4  False   True  True
shelter5  False   True  True

In [41]:
df[df < 50]

          dogs  birds  cats
shelter0   NaN     20     4
shelter1   NaN     14    14
shelter2   NaN     26     8
shelter3   NaN      4    15
shelter4   NaN     16    11
shelter5   NaN     38     3

In [43]:
df

          dogs  birds  cats
shelter0  6647     20     4
shelter1  4913     14    14
shelter2  1445     26     8
shelter3  3468      4    15
shelter4   289     16    11
shelter5  1445     38     3

In [48]:
df.loc['shelter0','dogs']-500

6147

In [49]:
df.query('cats > 8', inplace = True)

In [50]:
df

          dogs  birds  cats
shelter1  4913     14    14
shelter3  3468      4    15
shelter4   289     16    11

In [51]:
df['dogs'].sum()

8670

In [54]:
df.apply(np.sum, axis=0)

dogs     8670
birds      34
cats       40
dtype: int64

In [55]:
df.apply(np.sum, axis=1)

shelter1    4941
shelter3    3487
shelter4     316
dtype: int64